'use strict'
var db = require('../app/db');

exports.up = function(next){
	db.Building.create([
		{ "lat": 31.261367, "lng": 34.799495, "name": "15", "comments": "קפה"},
		{ "lat": 31.261563, "lng": 34.799573, "name": "16", "comments": "חוות מחשבים"},
		{ "lat": 31.262042, "lng": 34.799689, "name": "17"},
		{ "lat": 31.262228, "lng": 34.799669, "name": "18"},
		{ "lat": 31.261967, "lng": 34.800602, "name": "22", "comments": "ספריית ארן: עמדה להטענת כרטיס צילום, עמדות מחשבים, חוות מחשבים, מדפסות + ציבעוני, מכונות צילום, השאלת ספרים"},
		{ "lat": 31.262031, "lng": 34.802220, "name": "26"},
		{ "lat": 31.261742, "lng": 34.802697, "name": "28"},
		{ "lat": 31.262352, "lng": 34.802735, "name": "29"},
		{ "lat": 31.262022, "lng": 34.803035, "name": "30", "comments": "עמדות מחשבים, קפה, עמדה להטענת כרטיס, מכונות צילום, מדפסות"},
		{ "lat": 31.261751, "lng": 34.803352, "name": "32", "comments": "מכונות צילום, מסעדה"},
		{ "lat": 31.262347, "lng": 34.803384, "name": "33", "comments": "חוות מחשבים, מדפסות, מכונות צילום"},
		{ "lat": 31.262054, "lng": 34.803668, "name": "34", "comments": "מדפסות, קפה"},
		{ "lat": 31.26177,  "lng": 34.803939, "name": "35"},
		{ "lat": 31.262356, "lng": 34.803931, "name": "37"},
		{ "lat": 31.261316, "lng": 34.804036, "name": "38"},
		{ "lat": 31.261256, "lng": 34.804535, "name": "39"},
		{ "lat": 31.261476, "lng": 34.804529, "name": "40"},
		{ "lat": 31.262994, "lng": 34.805565, "name": "51"},
		{ "lat": 31.262815, "lng": 34.80483,  "name": "54"},
		{ "lat": 31.263233, "lng": 34.804712, "name": "55"},
		{ "lat": 31.263049, "lng": 34.804406, "name": "56", "comments": "קפה"},
		{ "lat": 31.263476, "lng": 34.804411, "name": "57"},
		{ "lat": 31.262689, "lng": 34.803898, "name": "58"},
		{ "lat": 31.263008, "lng": 34.80395,  "name": "59"},
		{ "lat": 31.26348,  "lng": 34.804122, "name": "60"},
		{ "lat": 31.263618, "lng": 34.803757, "name": "61"},
		{ "lat": 31.262689, "lng": 34.803248, "name": "62"},
		{ "lat": 31.263031, "lng": 34.803338, "name": "63"},
		{ "lat": 31.263246, "lng": 34.803397, "name": "64"},
		{ "lat": 31.263508, "lng": 34.803483, "name": "65"},
		{ "lat": 31.263645, "lng": 34.802823, "name": "66"},
		{ "lat": 31.263122, "lng": 34.802845, "name": "67"},
		{ "lat": 31.26309,  "lng": 34.801852, "name": "70", "comments":  "בית סטודנט: מדפסות + צבעוני + כריכה, קופת חולים , השאלת ספרים, חוות מחשבים, עמדות מחשבים, מסעדה, קפה, אקדמון, מכונות צילום, עמדה להטענת כרטיס, השאלת ספרים"},
		{ "lat": 31.26287,  "lng": 34.801364, "name": "71"},
		{ "lat": 31.263122, "lng": 34.80108,  "name": "71A"},
		{ "lat": 31.262742, "lng": 34.80035,  "name": "72", "comments": "עמדות מחשבים, קפה, מסעדה"},
		{ "lat": 31.262439, "lng": 34.800484, "name": "73"},
		{ "lat": 31.262659, "lng": 34.79939,  "name": "74", "comments": "חוות מחשבים, מדפסות"},
		{ "lat": 31.264654, "lng": 34.803092, "name": "90",  "comments": "עמדה להטענת כרטיס, מכונות צילום, מדפסות, קפה, עמדות מחשבים, חוות מחשבים"},
		{ "lat": 31.264296, "lng": 34.802936, "name": "91"},
		{ "lat": 31.26437,  "lng": 34.80336,  "name": "92", "comments": "חוות מחשבים"},
		{ "lat": 31.264801, "lng": 34.803403, "name": "93","comments": "מדפסות, חוות מחשבים"},
		{ "lat": 31.264925, "lng": 34.803628, "name": "94"},
		{ "lat": 31.264324, "lng": 34.80218,  "name": "95"},
		{ "lat": 31.264727, "lng": 34.801455, "name": "97"},
		{ "lat": 31.264237, "lng": 34.801101, "name": "98"},
		{ "lat": 31.257991, "lng": 34.802692, "name": "M2", "comments": "בניין פתולוגיה", },
		{ "lat": 31.259002, "lng": 34.800588, "name": "M4"},
		{ "lat": 31.260105, "lng": 34.803778, "name": "M5"},
		{ "lat": 31.260463, "lng": 34.803725, "name": "M6"},
		{ "lat": 31.260509, "lng": 34.80424,  "name": "M7"},
		{ "lat": 31.260655, "lng": 34.803671, "name": "M8"},
		{ "lat": 31.260224, "lng": 34.803472, "name": "M9"},
		{ "lat": 31.260013, "lng": 34.804293, "name": "M10"},
		{ "lat": 31.259885, "lng": 34.806793, "name": "גימל", "comments": "מעונות ג: חוות מחשבים, מדפסות, מכונות צילום, מועדון, סופר" },
		{ "lat": 31.263183, "lng": 34.797215, "name": "דלת", "comments": "מעונות ד: חוות מחשבים, מדפסות, מכונות צילום, מועדון"}
	], function(err) {
	    if (err)
	      throw err;
	    next();
	  });
};

exports.down = function(next){
  next();
};
